//Всплывающие окна.

//Метод alert.
alert("Hello world");
//Этот метод выводит всплывающие окно.
//Также можно подключить его взаимодействие на нажатие кнопки.

//Метод confirm.
confirm("Ты дома?");
//Выводит окно с выбором ок и отмена.
let data = confirm("Ты дома?")
if(data){
alert("Отлично")
}
//Это позволяет определить значение ,если ты нажал Ок, тогда значение будет true выведет Отлично.Если нажал отмена ничего не выведет.

//Метод prompt
let data = prompt("Введите ваше имя");
console.log(data);
//Этот метод выводит окно с полем для ввода.
//Если ввести имя и потвердить консоль выведет его.
//Если отменить ввод или ничего не вводить нажав ок ,консоль ничего не выведет.

//Способы применения методов.
//Мы можем применять сразу все методы ,для создания последовательного выбора.
let hud = null;
if ( confirm("Хотите присоединиться к нам?")) {
hud = prompt("Введите свое имя");
alert("Добро пожаловать," + hud);
} else {
alert("Вы отклонили приглошение");
}

//Функции и их применение.
//Чтобы обратиться к функции.
function per (word) { 
console.log(word + "!");
}
per ("Привет");
//Мы создали функцию и присвоили ей значение per.
//Чтобы вызвать функцию нужно обратиться к ее имени и в круглых скобках писать что хотим вывести.

function summa(arr){
let sum = 0;
for (let i = 1; i < arr.length;i++) {
sum += arr[1];
console.log(sum);
 }
}
let array[5,6,2,3];
summa(array); 
//Создали функцию.
//Присвоили ей значение.
//Создали цикл,указали условия.
//Указали значение переменной sum.
//Консоль выведет нам сумму массива.

function summa(arr){
let sum = 0;
for (let i = 1; i < arr.length;i++) {
sum += arr[1];
console.log(sum);
 }
}
let array[5,6,2,3];
summa(array); 
return sum;
//Вернули значение sum ,return sum;
//Функции удобны многим ,в данном случае мы можем создать несколько массивов и перебрать их используя лишь один цикл ,иначе нам пришлось бы создавать отдельные циклы для каждого массива.

//Локальные и глобальные переменные.
//Локальная переменная видна лишь внутри функции.
//Глобальная видна всегда.
let hil = 20;
function info() {
console.log(hil);
}
//Переменная выводиться без проблем .
info();
//Но если мы попытаемся вывести ее вне функции ,то консоль выдаст ошибку.
//Потому что при выводе этой переменной вне консоли она по просту не будет определена.












